cal/app/controllers/calendars_controller.rb

SELECT * FROM "calendars" WHERE ("calendars".user_id = 1) ORDER BY created_at ASC LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "calendars" WHERE ("calendars".user_id = 1)
---
  def index
    #@calendars = Calendar.all
	@calendars = @user.calendars.paginate ( :page => params[:page], :order => 'created_at ASC', :per_page => 3)

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
SELECT title, description, start_on, calendar_id, id FROM "events" WHERE (calendar_id = 1)
SELECT count(*) AS count_all FROM "events" WHERE ("events".calendar_id = 1)
---
  def show
    @calendar = Calendar.find(params[:id])

	calendarWithMaxId = Calendar.find(:last, :select => "id")
	calendarMaxId = calendarWithMaxId.id
	@hashArray = Array.new()
	t = Time.now

	1.upto(calendarMaxId) do |o|

      events1 = Event.find(:all, :select => "title", :conditions => ["calendar_id = ?", o])
      events2 = Event.find(:all, :select => "title, description, start_on, calendar_id, id", :conditions => ["calendar_id = ?", o])

	  hashH = Hash.new() # Main Hash

	  if events1.empty? # calendar number ... has no events

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
---
  def edit
    @calendar = Calendar.find(params[:id])

INSERT INTO "calendars" ("updated_at", "title", "description", "created_at") VALUES('2010-02-16 21:14:00', '1st calender', 'Für meine lieben Freunde', '2010-02-16 21:15:08')
---
  def create
	@calendar = @user.calendars.build(params[:calendar])

    respond_to do |format|
      if @calendar.save

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
---
  def update
    @calendar = Calendar.find(params[:id])

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
DELETE FROM "calendars" WHERE "id" = 1
---
  def destroy
    @calendar = Calendar.find(params[:id])
    @calendar.destroy