cal/app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    #@events = Event.all
	@events = @calendar.events.paginate(:page => params[:page],:order => 'created_at ASC', :per_page => 3)

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM "events" WHERE ("events"."id" = 2)
---
  def edit
    @event = Event.find(params[:id])

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
INSERT INTO "events" ("updated_at", "title", "description", "start_on", "stop_on", "calendar_id", "created_at") VALUES('2010-02-16 21:22:56', NULL, 'hjhh', NULL, NULL, NULL, '2010-02-16 21:22:56')
---
  def create
    @calendar = Calendar.find(params[:calendar_id])
	@event = @calendar.events.build(params[:event])

    #@event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "description" = 'Fasching
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM "events" WHERE ("events"."id" = 2)
DELETE FROM "events" WHERE "id" = 2
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy

SELECT * FROM "calendars" WHERE ("calendars"."id" = 1)
---
  def load_calendar
    @calendar = Calendar.find(params[:calendar_id])